# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_key_vault_certificate.vpn: Reading...
data.azurerm_key_vault_certificate.vpn: Read complete after 0s [id=https://kvaltinnauth001hub.vault.azure.net/certificates/VPNRootCert/dc43a0f1e5e549cf845744cc5085f007]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application.vpn will be updated in-place
  ~ resource "azuread_application" "vpn" {
        id                             = "/applications/7d7ed3f0-614d-446e-b563-0c500d38f152"
      ~ owners                         = [
          - "6eaed23e-df7f-4708-9c8e-a7f34deeadb4",
          + "3863fbc0-a24b-42bf-af3d-f45111814457",
            # (3 unchanged elements hidden)
        ]
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # azurerm_private_dns_resolver.resolver will be updated in-place
  ~ resource "azurerm_private_dns_resolver" "resolver" {
        id                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/dnsResolvers/dnsresaltinnauth001hub"
        name                = "dnsresaltinnauth001hub"
      ~ tags                = {
          ~ "CreatedAt"   = "1/10/2025 3:03:03 PM" -> "2025-01-10T15:03:03Z"
            "Environment" = "hub"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (3 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_configuration_contributor["c410f062-def4-44f5-9a45-b23ddcdd57c3"] will be created
  + resource "azurerm_role_assignment" "app_configuration_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c410f062-def4-44f5-9a45-b23ddcdd57c3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Contributor"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.app_configuration_data_owner["3863fbc0-a24b-42bf-af3d-f45111814457"] will be created
  + resource "azurerm_role_assignment" "app_configuration_data_owner" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3863fbc0-a24b-42bf-af3d-f45111814457"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Owner"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.app_configuration_data_owner["48587eaa-8f33-43ed-a0c3-108c3681e84b"] must be replaced
-/+ resource "azurerm_role_assignment" "app_configuration_data_owner" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/1f98a7d5-b64c-3ed9-8f2a-f0e453e60a5b" -> (known after apply)
      ~ name                             = "1f98a7d5-b64c-3ed9-8f2a-f0e453e60a5b" -> (known after apply)
      ~ principal_type                   = "User" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> (known after apply)
      ~ role_definition_name             = "User Access Administrator" -> "App Configuration Data Owner" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_configuration_data_owner["6eaed23e-df7f-4708-9c8e-a7f34deeadb4"] will be destroyed
  # (because key ["6eaed23e-df7f-4708-9c8e-a7f34deeadb4"] is not in for_each map)
  - resource "azurerm_role_assignment" "app_configuration_data_owner" {
      - id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/c3a55481-a375-5150-6ecc-25a4b024e729" -> null
      - name                 = "c3a55481-a375-5150-6ecc-25a4b024e729" -> null
      - principal_id         = "6eaed23e-df7f-4708-9c8e-a7f34deeadb4" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> null
      - role_definition_name = "User Access Administrator" -> null
      - scope                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub" -> null
    }

  # azurerm_role_assignment.app_configuration_data_owner["a9585a64-20f0-4d18-aba6-9930f92b809c"] must be replaced
-/+ resource "azurerm_role_assignment" "app_configuration_data_owner" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/671ee7db-4db3-3d40-c850-9e23dea6b3db" -> (known after apply)
      ~ name                             = "671ee7db-4db3-3d40-c850-9e23dea6b3db" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> (known after apply)
      ~ role_definition_name             = "User Access Administrator" -> "App Configuration Data Owner" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_configuration_data_owner["be1a510a-db1e-473c-a73a-558cdb68e353"] must be replaced
-/+ resource "azurerm_role_assignment" "app_configuration_data_owner" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/2ab066da-750e-4c4e-c3b1-418febfcade9" -> (known after apply)
      ~ name                             = "2ab066da-750e-4c4e-c3b1-418febfcade9" -> (known after apply)
      ~ principal_type                   = "User" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> (known after apply)
      ~ role_definition_name             = "User Access Administrator" -> "App Configuration Data Owner" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_configuration_data_reader["6d54df21-3547-41a2-8d0d-529fad054807"] will be created
  + resource "azurerm_role_assignment" "app_configuration_data_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6d54df21-3547-41a2-8d0d-529fad054807"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Reader"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.key_vault_administrator["3863fbc0-a24b-42bf-af3d-f45111814457"] will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3863fbc0-a24b-42bf-af3d-f45111814457"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.KeyVault/vaults/kvaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.key_vault_administrator["6eaed23e-df7f-4708-9c8e-a7f34deeadb4"] will be destroyed
  # (because key ["6eaed23e-df7f-4708-9c8e-a7f34deeadb4"] is not in for_each map)
  - resource "azurerm_role_assignment" "key_vault_administrator" {
      - id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.KeyVault/vaults/kvaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/14d75466-6279-60ff-b2be-50088aea61c9" -> null
      - name                 = "14d75466-6279-60ff-b2be-50088aea61c9" -> null
      - principal_id         = "6eaed23e-df7f-4708-9c8e-a7f34deeadb4" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> null
      - role_definition_name = "Key Vault Administrator" -> null
      - scope                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.KeyVault/vaults/kvaltinnauth001hub" -> null
    }

  # azurerm_role_assignment.network_contributor["48587eaa-8f33-43ed-a0c3-108c3681e84b"] will be destroyed
  # (because key ["48587eaa-8f33-43ed-a0c3-108c3681e84b"] is not in for_each map)
  - resource "azurerm_role_assignment" "network_contributor" {
      - id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/26bcc099-e45c-ee84-64f2-f80d99396731" -> null
      - name                 = "26bcc099-e45c-ee84-64f2-f80d99396731" -> null
      - principal_id         = "48587eaa-8f33-43ed-a0c3-108c3681e84b" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> null
      - role_definition_name = "Network Contributor" -> null
      - scope                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub" -> null
    }

  # azurerm_role_assignment.network_contributor["a9585a64-20f0-4d18-aba6-9930f92b809c"] will be destroyed
  # (because key ["a9585a64-20f0-4d18-aba6-9930f92b809c"] is not in for_each map)
  - resource "azurerm_role_assignment" "network_contributor" {
      - id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/1995b685-0dc3-bf3b-d74a-e7c15c0d693b" -> null
      - name                 = "1995b685-0dc3-bf3b-d74a-e7c15c0d693b" -> null
      - principal_id         = "a9585a64-20f0-4d18-aba6-9930f92b809c" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> null
      - role_definition_name = "Network Contributor" -> null
      - scope                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub" -> null
    }

  # azurerm_role_assignment.network_contributor["be1a510a-db1e-473c-a73a-558cdb68e353"] will be destroyed
  # (because key ["be1a510a-db1e-473c-a73a-558cdb68e353"] is not in for_each map)
  - resource "azurerm_role_assignment" "network_contributor" {
      - id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/e51c40a4-2992-866c-868a-62abe3377b89" -> null
      - name                 = "e51c40a4-2992-866c-868a-62abe3377b89" -> null
      - principal_id         = "be1a510a-db1e-473c-a73a-558cdb68e353" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> null
      - role_definition_name = "Network Contributor" -> null
      - scope                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub" -> null
    }

  # azurerm_role_assignment.reader["48587eaa-8f33-43ed-a0c3-108c3681e84b"] will be destroyed
  # (because key ["48587eaa-8f33-43ed-a0c3-108c3681e84b"] is not in for_each map)
  - resource "azurerm_role_assignment" "reader" {
      - id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/9c1e18e5-2b0d-070d-f32a-8c373d2e6838" -> null
      - name                 = "9c1e18e5-2b0d-070d-f32a-8c373d2e6838" -> null
      - principal_id         = "48587eaa-8f33-43ed-a0c3-108c3681e84b" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> null
      - role_definition_name = "Reader" -> null
      - scope                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub" -> null
    }

  # azurerm_role_assignment.reader["a9585a64-20f0-4d18-aba6-9930f92b809c"] will be destroyed
  # (because key ["a9585a64-20f0-4d18-aba6-9930f92b809c"] is not in for_each map)
  - resource "azurerm_role_assignment" "reader" {
      - id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/6f4f9ace-2a1c-618d-1d38-648189fb09f9" -> null
      - name                 = "6f4f9ace-2a1c-618d-1d38-648189fb09f9" -> null
      - principal_id         = "a9585a64-20f0-4d18-aba6-9930f92b809c" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> null
      - role_definition_name = "Reader" -> null
      - scope                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub" -> null
    }

  # azurerm_role_assignment.reader["be1a510a-db1e-473c-a73a-558cdb68e353"] will be destroyed
  # (because key ["be1a510a-db1e-473c-a73a-558cdb68e353"] is not in for_each map)
  - resource "azurerm_role_assignment" "reader" {
      - id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/479bad50-a044-236c-f03b-a91e73131427" -> null
      - name                 = "479bad50-a044-236c-f03b-a91e73131427" -> null
      - principal_id         = "be1a510a-db1e-473c-a73a-558cdb68e353" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> null
      - role_definition_name = "Reader" -> null
      - scope                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub" -> null
    }

  # azurerm_role_assignment.user_access_administrator["3863fbc0-a24b-42bf-af3d-f45111814457"] will be created
  + resource "azurerm_role_assignment" "user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3863fbc0-a24b-42bf-af3d-f45111814457"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.user_access_administrator["48587eaa-8f33-43ed-a0c3-108c3681e84b"] will be created
  + resource "azurerm_role_assignment" "user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "48587eaa-8f33-43ed-a0c3-108c3681e84b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.user_access_administrator["6eaed23e-df7f-4708-9c8e-a7f34deeadb4"] will be created
  + resource "azurerm_role_assignment" "user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6eaed23e-df7f-4708-9c8e-a7f34deeadb4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.user_access_administrator["a9585a64-20f0-4d18-aba6-9930f92b809c"] will be created
  + resource "azurerm_role_assignment" "user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9585a64-20f0-4d18-aba6-9930f92b809c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.user_access_administrator["be1a510a-db1e-473c-a73a-558cdb68e353"] will be created
  + resource "azurerm_role_assignment" "user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "be1a510a-db1e-473c-a73a-558cdb68e353"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 12 to add, 2 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/hub` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/hub.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_hub.tfstate.tfplan`